name: "video_preprocessor"
backend: "python"
max_batch_size: 0

input [
  {
    name: "video_path"
    data_type: TYPE_STRING
    dims: [1]
  }
]

# 32 frames uniformly sampled, original resolution preserved
output [
  {
    name: "frames"
    data_type: TYPE_FP32
    dims: [32, -1, -1, 3]
  }
]

instance_group [{ kind: KIND_CPU }]
