name: "detect_track"
backend: "python"
max_batch_size: 0

input [
  {
    name: "frames"
    data_type: TYPE_FP32
    dims: [-1, -1, -1, 3]
  }
]

# P = number of tracked pedestrians (variable)
output [
  {
    name: "ped_clip"
    data_type: TYPE_FP32
    dims: [-1, 16, 224, 224, 3]
  },
  {
    name: "track_ids"
    data_type: TYPE_INT32
    dims: [-1]
  },
  {
    name: "traj_features"
    data_type: TYPE_FP32
    dims: [-1, 16, 6]
  }
]

instance_group [{ kind: KIND_CPU }]
